In [1]:
import pandas as pd
import random

data = {
    'Tipe Ujian' : ['UTS1', 'UAS1', 'UTS2', 'UAS2']*3,
    'Mata Pelajaran' : ['Fisika']*4 + ['Matematika']*4+['Statistika']*4,
    'Rata2 Waktu Belajar (menit)' : [random.choice(range(200, 800)) for i in range(12)],
    'Rata2 Nilai Ujian' : [random.choice(range(40, 100)) for i in range(12)] 
}

df = pd.DataFrame(data)
df

   Tipe Ujian Mata Pelajaran  Rata2 Waktu Belajar (menit)  Rata2 Nilai Ujian
0        UTS1         Fisika                          744                 44
1        UAS1         Fisika                          575                 42
2        UTS2         Fisika                          773                 98
3        UAS2         Fisika                          494                 75
4        UTS1     Matematika                          711                 72
5        UAS1     Matematika                          662                 65
6        UTS2     Matematika                          592                 72
7        UAS2     Matematika                          633                 51
8        UTS1     Statistika                          610                 89
9        UAS1     Statistika                          706                 84
10       UTS2     Statistika                          747                 98
11       UAS2     Statistika                          610                 99



---



---

## Soal 1. Data Cleaning

Lakukan sorting data berdasarkan Rata2 nilai ujian dari terbesar ke terkecil

*   Lakukan sorting data berdasarkan Rata2 nilai ujian dari terbesar ke terkecil
*   Tipe Ujian dan Mata pelajaran apakah yang memiliki rata2 nilai terkecil?

In [2]:
#code here
# sorting Rata2 Nilai Ujian dari terbesar ke terkecil
print(df.sort_values('Rata2 Nilai Ujian', ascending=False))

   Tipe Ujian Mata Pelajaran  Rata2 Waktu Belajar (menit)  Rata2 Nilai Ujian
11       UAS2     Statistika                          610                 99
2        UTS2         Fisika                          773                 98
10       UTS2     Statistika                          747                 98
8        UTS1     Statistika                          610                 89
9        UAS1     Statistika                          706                 84
3        UAS2         Fisika                          494                 75
4        UTS1     Matematika                          711                 72
6        UTS2     Matematika                          592                 72
5        UAS1     Matematika                          662                 65
7        UAS2     Matematika                          633                 51
0        UTS1         Fisika                          744                 44
1        UAS1         Fisika                          575                 42

Expected output:

(Output bisa berbeda-beda)

![alt text](https://drive.google.com/uc?id=1iv8P-LDdN3WpTVX9qST3kL7QSNSDiOc2)

Tipe Ujian dan Mapel nilai Rata2 terkecil adalah UAS2 - Matermatika



---



---

<h2>Soal 2: Data Restructuring</h2>

Jelaskan itu pivoting dan melting data

Pivoting merupakan pengubahan bentuk data yang berbentuk vertikal menjadi horizontal (atau data di baris menjadi kolom, dan kolom menjadi baris), sedangkan melting yaitu mengubah kembali data pivot menjadi bentuk semula



---



---

<h2>Soal 3: Reshaping Data 1</h2>

In [3]:
import pandas as pd
import random

data = {
    'Tipe Ujian' : ['UTS1', 'UAS1', 'UTS2', 'UAS2']*3,
    'Mata Pelajaran' : ['Fisika']*4 + ['Matematika']*4+['Statistika']*4,
    'Rata2 Waktu Belajar (menit)' : [random.choice(range(200, 800)) for i in range(12)],
    'Rata2 Nilai Ujian' : [random.choice(range(40, 100)) for i in range(12)] 
}

df = pd.DataFrame(data)
df

   Tipe Ujian Mata Pelajaran  Rata2 Waktu Belajar (menit)  Rata2 Nilai Ujian
0        UTS1         Fisika                          388                 99
1        UAS1         Fisika                          425                 83
2        UTS2         Fisika                          775                 51
3        UAS2         Fisika                          352                 67
4        UTS1     Matematika                          501                 85
5        UAS1     Matematika                          265                 51
6        UTS2     Matematika                          353                 83
7        UAS2     Matematika                          748                 75
8        UTS1     Statistika                          423                 83
9        UAS1     Statistika                          538                 55
10       UTS2     Statistika                          391                 86
11       UAS2     Statistika                          669                 56

Perhatikan data di atas, kemudian ubahlah bentuknya agar sesuai yang di harapkan.

In [4]:
#code here
hasil = df.pivot_table(values=['Rata2 Nilai Ujian','Rata2 Waktu Belajar (menit)' ], index = 'Tipe Ujian', columns = 'Mata Pelajaran'  )
hasil

               Rata2 Nilai Ujian                        \
Mata Pelajaran            Fisika Matematika Statistika
Tipe Ujian
UAS1                          83         51         55
UAS2                          67         75         56
UTS1                          99         85         83
UTS2                          51         83         86

               Rata2 Waktu Belajar (menit)
Mata Pelajaran                      Fisika Matematika Statistika
Tipe Ujian
UAS1                                   425        265        538
UAS2                                   352        748        669
UTS1                                   388        501        423
UTS2                                   775        353        391

Expected Result:

(Output bisa berbeda-beda)

![alt text](https://drive.google.com/uc?id=1XufsfqZe7-XZLsb92SpATexy-QRZE0ow)



---



---

<h2>Soal 4: Reshaping Data 2</h2>

In [11]:
import pandas as pd

data = {
    'Hari' : ['Sabtu', 'Minggu'],
    'Kebun Binatang' : [271, 399],
    'Dufan' : [501, 700],
    'Disney' : [1000, 1001],
    'Bali' : [900, 803]
}
df = pd.DataFrame(data).set_index('Hari')
df

        Kebun Binatang  Dufan  Disney  Bali
Hari
Sabtu              271    501    1000   900
Minggu             399    700    1001   803

diatas adalah data tentang jumlah pengunjung di berbagai tempat hiburan, ubahlah struktur data tersebut sehingga sesuai dengan hasil yang diharapkan.

In [24]:
#code here
pd.melt(df, id_vars =['Hari'], value_vars =['Kebun Binatang', 'Dufan', 'Disney', 'Bali'], var_name = 'Tempat Hiburan', value_name ='Pengunjung')

KeyError: "The following 'id_vars' are not present in the DataFrame: ['Hari']"

Expected Result:

(Output bisa berbeda-beda)

![alt text](https://drive.google.com/uc?id=159mIqcyfeD30EEcyZmmkovORa6cZDLtn)



---



---

<h2>Soal 5: Data Enrichment</h2>

Lakukan binning data menggunakan qcut sehingga sesuai hasil yang diharapkan

In [ ]:
#code here
labels = ['tidak lulus','remedial', 'lulus']
df['Keterangan kelulusan'] = pd.qcut(df['Rata2 Nilai Ujian'], q = 3, labels = labels)
print(df)

Expected Output:

(Output bisa berbeda-beda)

![alt text](https://drive.google.com/uc?id=1h2_u5_xhD1_QtPpItTj-o3lljHhnr4XS)



---



---